CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_dma.h
/*!
    \file    gd32l23x_dma.h
    \brief   definitions for the DMA

    \version 2021-08-04, V1.0.0, firmware for GD32L23x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32L23X_DMA_H
#define GD32L23X_DMA_H

#include "gd32l23x.h"

/* DMA definitions */
#define DMA                               DMA_BASE                                                            /*!< DMA base address */
#define DMAMUX                            DMAMUX_BASE                                                         /*!< DMAMUX base address */

/* registers definitions */
#define DMA_INTF                          REG32(DMA + 0x00000000U)                                            /*!< DMA interrupt flag register */
#define DMA_INTC                          REG32(DMA + 0x00000004U)                                            /*!< DMA interrupt flag clear register */
#define DMA_CH0CTL                        REG32(DMA + 0x00000008U)                                            /*!< DMA channel 0 control register */
#define DMA_CH0CNT                        REG32(DMA + 0x0000000CU)                                            /*!< DMA channel 0 counter register */
#define DMA_CH0PADDR                      REG32(DMA + 0x00000010U)                                            /*!< DMA channel 0 peripheral base address register */
#define DMA_CH0MADDR                      REG32(DMA + 0x00000014U)                                            /*!< DMA channel 0 memory base address register */
#define DMA_CH1CTL                        REG32(DMA + 0x0000001CU)                                            /*!< DMA channel 1 control register */
#define DMA_CH1CNT                        REG32(DMA + 0x00000020U)                                            /*!< DMA channel 1 counter register */
#define DMA_CH1PADDR                      REG32(DMA + 0x00000024U)                                            /*!< DMA channel 1 peripheral base address register */
#define DMA_CH1MADDR                      REG32(DMA + 0x00000028U)                                            /*!< DMA channel 1 memory base address register */
#define DMA_CH2CTL                        REG32(DMA + 0x00000030U)                                            /*!< DMA channel 2 control register */
#define DMA_CH2CNT                        REG32(DMA + 0x00000034U)                                            /*!< DMA channel 2 counter register */
#define DMA_CH2PADDR                      REG32(DMA + 0x00000038U)                                            /*!< DMA channel 2 peripheral base address register */
#define DMA_CH2MADDR                      REG32(DMA + 0x0000003CU)                                            /*!< DMA channel 2 memory base address register */
#define DMA_CH3CTL                        REG32(DMA + 0x00000044U)                                            /*!< DMA channel 3 control register */
#define DMA_CH3CNT                        REG32(DMA + 0x00000048U)                                            /*!< DMA channel 3 counter register */
#define DMA_CH3PADDR                      REG32(DMA + 0x0000004CU)                                            /*!< DMA channel 3 peripheral base address register */
#define DMA_CH3MADDR                      REG32(DMA + 0x00000050U)                                            /*!< DMA channel 3 memory base address register */
#define DMA_CH4CTL                        REG32(DMA + 0x00000058U)                                            /*!< DMA channel 4 control register */
#define DMA_CH4CNT                        REG32(DMA + 0x0000005CU)                                            /*!< DMA channel 4 counter register */
#define DMA_CH4PADDR                      REG32(DMA + 0x00000060U)                                            /*!< DMA channel 4 peripheral base address register */
#define DMA_CH4MADDR                      REG32(DMA + 0x00000064U)                                            /*!< DMA channel 4 memory base address register */
#define DMA_CH5CTL                        REG32(DMA + 0x0000006CU)                                            /*!< DMA channel 5 control register */
#define DMA_CH5CNT                        REG32(DMA + 0x00000070U)                                            /*!< DMA channel 5 counter register */
#define DMA_CH5PADDR                      REG32(DMA + 0x00000074U)                                            /*!< DMA channel 5 peripheral base address register */
#define DMA_CH5MADDR                      REG32(DMA + 0x00000078U)                                            /*!< DMA channel 5 memory base address register */
#define DMA_CH6CTL                        REG32(DMA + 0x00000080U)                                            /*!< DMA channel 6 control register */
#define DMA_CH6CNT                        REG32(DMA + 0x00000084U)                                            /*!< DMA channel 6 counter register */
#define DMA_CH6PADDR                      REG32(DMA + 0x00000088U)                                            /*!< DMA channel 6 peripheral base address register */
#define DMA_CH6MADDR                      REG32(DMA + 0x0000008CU)                                            /*!< DMA channel 6 memory base address register */

