CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_dma.h
#define DMAMUX_RM_CH0CFG                  REG32(DMAMUX + 0x00000000U)                                         /*!< DMAMUX request multiplexer channel 0 configuration register */
#define DMAMUX_RM_CH1CFG                  REG32(DMAMUX + 0x00000004U)                                         /*!< DMAMUX request multiplexer channel 1 configuration register */
#define DMAMUX_RM_CH2CFG                  REG32(DMAMUX + 0x00000008U)                                         /*!< DMAMUX request multiplexer channel 2 configuration register */
#define DMAMUX_RM_CH3CFG                  REG32(DMAMUX + 0x0000000CU)                                         /*!< DMAMUX request multiplexer channel 3 configuration register */
#define DMAMUX_RM_CH4CFG                  REG32(DMAMUX + 0x00000010U)                                         /*!< DMAMUX request multiplexer channel 4 configuration register */
#define DMAMUX_RM_CH5CFG                  REG32(DMAMUX + 0x00000014U)                                         /*!< DMAMUX request multiplexer channel 5 configuration register */
#define DMAMUX_RM_CH6CFG                  REG32(DMAMUX + 0x00000018U)                                         /*!< DMAMUX request multiplexer channel 6 configuration register */
#define DMAMUX_RM_INTF                    REG32(DMAMUX + 0x00000080U)                                         /*!< DMAMUX request multiplexer channel interrupt flag register */
#define DMAMUX_RM_INTC                    REG32(DMAMUX + 0x00000084U)                                         /*!< DMAMUX request multiplexer channel interrupt flag clear register */
#define DMAMUX_RG_CH0CFG                  REG32(DMAMUX + 0x00000100U)                                         /*!< DMAMUX generator channel 0 configuration register */
#define DMAMUX_RG_CH1CFG                  REG32(DMAMUX + 0x00000104U)                                         /*!< DMAMUX generator channel 1 configuration register */
#define DMAMUX_RG_CH2CFG                  REG32(DMAMUX + 0x00000108U)                                         /*!< DMAMUX generator channel 2 configuration register */
#define DMAMUX_RG_CH3CFG                  REG32(DMAMUX + 0x0000010CU)                                         /*!< DMAMUX generator channel 3 configuration register */
#define DMAMUX_RG_INTF                    REG32(DMAMUX + 0x00000140U)                                         /*!< DMAMUX generator channel interrupt flag register */
#define DMAMUX_RG_INTC                    REG32(DMAMUX + 0x00000144U)                                         /*!< DMAMUX rgenerator channel interrupt flag clear register */

/* bits definitions */
/* DMA_INTF */
#define DMA_INTF_GIF                      BIT(0)                                                              /*!< global interrupt flag of channel */
#define DMA_INTF_FTFIF                    BIT(1)                                                              /*!< full transfer finish flag of channel */
#define DMA_INTF_HTFIF                    BIT(2)                                                              /*!< half transfer finish flag of channel */
#define DMA_INTF_ERRIF                    BIT(3)                                                              /*!< error flag of channel */

/* DMA_INTC */
#define DMA_INTC_GIFC                     BIT(0)                                                              /*!< clear global interrupt flag of channel */
#define DMA_INTC_FTFIFC                   BIT(1)                                                              /*!< clear transfer finish flag of channel */
#define DMA_INTC_HTFIFC                   BIT(2)                                                              /*!< clear half transfer finish flag of channel */
#define DMA_INTC_ERRIFC                   BIT(3)                                                              /*!< clear error flag of channel */

/* DMA_CHxCTL, x=0..6 */
#define DMA_CHXCTL_CHEN                   BIT(0)                                                              /*!< channel x enable */
#define DMA_CHXCTL_FTFIE                  BIT(1)                                                              /*!< enable bit for channel x transfer complete interrupt */
#define DMA_CHXCTL_HTFIE                  BIT(2)                                                              /*!< enable bit for channel x transfer half complete interrupt */
#define DMA_CHXCTL_ERRIE                  BIT(3)                                                              /*!< enable bit for channel x error interrupt */
#define DMA_CHXCTL_DIR                    BIT(4)                                                              /*!< direction of the data transfer on the channel */
#define DMA_CHXCTL_CMEN                   BIT(5)                                                              /*!< circulation mode */
#define DMA_CHXCTL_PNAGA                  BIT(6)                                                              /*!< next address generation algorithm of peripheral */
#define DMA_CHXCTL_MNAGA                  BIT(7)                                                              /*!< next address generation algorithm of memory */
#define DMA_CHXCTL_PWIDTH                 BITS(8,9)                                                           /*!< transfer data size of peripheral */
#define DMA_CHXCTL_MWIDTH                 BITS(10,11)                                                         /*!< transfer data size of memory */
#define DMA_CHXCTL_PRIO                   BITS(12,13)                                                         /*!< priority level of channelx */
#define DMA_CHXCTL_M2M                    BIT(14)                                                             /*!< memory to memory mode */

/* DMA_CHxCNT, x=0..6 */
#define DMA_CHXCNT_CNT                    BITS(0,15)                                                          /*!< transfer counter */

/* DMA_CHxPADDR, x=0..6 */
#define DMA_CHXPADDR_PADDR                BITS(0,31)                                                          /*!< peripheral base address */

/* DMA_CHxMADDR, x=0..6 */
#define DMA_CHXMADDR_MADDR                BITS(0,31)                                                          /*!< memory base address */

