CommunityGD32Cores/GD32Firmware/GD32L23x/GD32L23x_standard_peripheral/Include/gd32l23x_dma.h
/* DMAMUX interrupt flags */
typedef enum {
    /* interrupt flags in INTF register */
    DMAMUX_INT_FLAG_MUXCH0_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 0U, DMAMUX_RM_CH0CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 0 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH1_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 1U, DMAMUX_RM_CH1CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 1 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH2_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 2U, DMAMUX_RM_CH2CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 2 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH3_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 3U, DMAMUX_RM_CH3CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 3 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH4_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 4U, DMAMUX_RM_CH4CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 4 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH5_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 5U, DMAMUX_RM_CH5CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 5 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_MUXCH6_SO = DMAMUX_REGIDX_BIT2(DMAMUX_RM_INTF_REG_OFFSET, 6U, DMAMUX_RM_CH6CFG_REG_OFFSET, 8U), /*!< DMAMUX request multiplexer channel 6 synchronization overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH0_TO = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 0U, DMAMUX_RG_CH0CFG_REG_OFFSET, 8U), /*!< DMAMUX request generator channel 0 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH1_TO = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 1U, DMAMUX_RG_CH1CFG_REG_OFFSET, 8U), /*!< DMAMUX request generator channel 1 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH2_TO = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 2U, DMAMUX_RG_CH2CFG_REG_OFFSET, 8U), /*!< DMAMUX request generator channel 2 trigger overrun interrupt flag */
    DMAMUX_INT_FLAG_GENCH3_TO = DMAMUX_REGIDX_BIT2(DMAMUX_RG_INTF_REG_OFFSET, 3U, DMAMUX_RG_CH3CFG_REG_OFFSET, 8U), /*!< DMAMUX request generator channel 3 trigger overrun interrupt flag */
} dmamux_interrupt_flag_enum;

/* DMA channel selection */
typedef enum {
    DMA_CH0 = 0U,                                                                                             /*!< DMA Channel 0 */
    DMA_CH1,                                                                                                  /*!< DMA Channel 1 */
    DMA_CH2,                                                                                                  /*!< DMA Channel 2 */
    DMA_CH3,                                                                                                  /*!< DMA Channel 3 */
    DMA_CH4,                                                                                                  /*!< DMA Channel 4 */
    DMA_CH5,                                                                                                  /*!< DMA Channel 5 */
    DMA_CH6,                                                                                                  /*!< DMA Channel 6 */
} dma_channel_enum;

/* DMAMUX request multiplexer channel */
typedef enum {
    DMAMUX_MUXCH0 = 0U,                                                                                       /*!< DMAMUX request multiplexer Channel0 */
    DMAMUX_MUXCH1,                                                                                            /*!< DMAMUX request multiplexer Channel1 */
    DMAMUX_MUXCH2,                                                                                            /*!< DMAMUX request multiplexer Channel2 */
    DMAMUX_MUXCH3,                                                                                            /*!< DMAMUX request multiplexer Channel3 */
    DMAMUX_MUXCH4,                                                                                            /*!< DMAMUX request multiplexer Channel4 */
    DMAMUX_MUXCH5,                                                                                            /*!< DMAMUX request multiplexer Channel5 */
    DMAMUX_MUXCH6,                                                                                            /*!< DMAMUX request multiplexer Channel6 */
} dmamux_multiplexer_channel_enum;

/* DMAMUX request generator channel */
typedef enum {
    DMAMUX_GENCH0 = 0U,                                                                                       /*!< DMAMUX request generator Channel0 */
    DMAMUX_GENCH1,                                                                                            /*!< DMAMUX request generator Channel1 */
    DMAMUX_GENCH2,                                                                                            /*!< DMAMUX request generator Channel2 */
    DMAMUX_GENCH3,                                                                                            /*!< DMAMUX request generator Channel3 */
} dmamux_generator_channel_enum;

/* DMA initialization structure */
typedef struct {
    uint32_t periph_addr;                                                                                     /*!< peripheral base address */
    uint32_t periph_width;                                                                                    /*!< transfer data size of peripheral */
    uint32_t memory_addr;                                                                                     /*!< memory base address */
    uint32_t memory_width;                                                                                    /*!< transfer data size of memory */
    uint32_t number;                                                                                          /*!< channel transfer number */
    uint32_t priority;                                                                                        /*!< channel priority level */
    uint8_t periph_inc;                                                                                       /*!< peripheral increasing mode */
    uint8_t memory_inc;                                                                                       /*!< memory increasing mode */
    uint8_t direction;                                                                                        /*!< channel data transfer direction */
    uint32_t request;                                                                                         /*!< channel input identification */
} dma_parameter_struct;

/* DMAMUX request multiplexer synchronization configuration structure */
typedef struct {
    uint32_t sync_id;                                                                                         /*!< synchronization input identification */
    uint32_t sync_polarity;                                                                                   /*!< synchronization input polarity */
    uint32_t request_number;                                                                                  /*!< number of DMA requests to forward */
} dmamux_sync_parameter_struct;

/* DMAMUX request generator trigger configuration structure */
typedef struct {
    uint32_t trigger_id;                                                                                      /*!< trigger input identification */
    uint32_t trigger_polarity;                                                                                /*!< DMAMUX request generator trigger polarity */
    uint32_t request_number;                                                                                  /*!< number of DMA requests to be generated */
} dmamux_gen_parameter_struct;

/* DMA reset value */
#define DMA_CHCTL_RESET_VALUE             ((uint32_t)0x00000000U)                                             /*!< the reset value of DMA channel CHXCTL register */
#define DMA_CHCNT_RESET_VALUE             ((uint32_t)0x00000000U)                                             /*!< the reset value of DMA channel CHXCNT register */
#define DMA_CHPADDR_RESET_VALUE           ((uint32_t)0x00000000U)                                             /*!< the reset value of DMA channel CHXPADDR register */
#define DMA_CHMADDR_RESET_VALUE           ((uint32_t)0x00000000U)                                             /*!< the reset value of DMA channel CHXMADDR register */
#define DMA_CHINTF_RESET_VALUE            (DMA_INTF_GIF | DMA_INTF_FTFIF | \
        DMA_INTF_HTFIF | DMA_INTF_ERRIF)                                   /*!< clear DMA channel DMA_INTF register */

#define DMA_FLAG_ADD(flag,shift)          ((flag) << ((uint32_t)(shift) * 4U))                                /*!< DMA channel flag shift */

/* DMA_CHCTL base address */
#define DMA_CHXCTL_BASE                   (DMA + 0x00000008U)                                                 /*!< the base address of DMA channel CHXCTL register */
#define DMA_CHXCNT_BASE                   (DMA + 0x0000000CU)                                                 /*!< the base address of DMA channel CHXCNT register */
#define DMA_CHXPADDR_BASE                 (DMA + 0x00000010U)                                                 /*!< the base address of DMA channel CHXPADDR register */
#define DMA_CHXMADDR_BASE                 (DMA + 0x00000014U)                                                 /*!< the base address of DMA channel CHXMADDR register */

/* DMA channel shift bit */
#define DMA_CHCTL(channel)                REG32(DMA_CHXCTL_BASE + 0x14U * (uint32_t)(channel))                /*!< the address of DMA channel CHXCTL register */
#define DMA_CHCNT(channel)                REG32(DMA_CHXCNT_BASE + 0x14U * (uint32_t)(channel))                /*!< the address of DMA channel CHXCNT register */
#define DMA_CHPADDR(channel)              REG32(DMA_CHXPADDR_BASE + 0x14U * (uint32_t)(channel))              /*!< the address of DMA channel CHXPADDR register */
#define DMA_CHMADDR(channel)              REG32(DMA_CHXMADDR_BASE + 0x14U * (uint32_t)(channel))              /*!< the address of DMA channel CHXMADDR register */

/* DMAMUX_RM_CHxCFG base address */
#define DMAMUX_RM_CHXCFG_BASE             (DMAMUX)                                                            /*!< the base address of DMAMUX request multiplexer channel CHxCFG register */

